Revit 2027 API
Material.ClearMaterialAspect Method
 Removes an aspect from the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearMaterialAspect(
	MaterialAspect aspect
)
Public Sub ClearMaterialAspect (
	aspect As MaterialAspect
)
public:
void ClearMaterialAspect(
	MaterialAspect aspect
)
member ClearMaterialAspect :
        aspect : MaterialAspect -> unit
Parameters
aspect MaterialAspect
 The material aspect.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace